tutorials/18pipe/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-5;
        relTol           0.01;
        smoother         DICGaussSeidel;

    }

    "(U)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-5;
        relTol          0.01;
    }

    "(U)Final"
    {
        $U;
        relTol          0;
    }

    "pFinal"
    {
        $p;
        relTol          0;
    }
    Usup
    {
	
        solver           GAMG;
        tolerance        1e-5;
        relTol           0.01;
        smoother         DICGaussSeidel;
    }
    Phi
    {
        $p;
    }    
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 2;
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 0;
}


PIMPLE
{
    momentumPredictor no;
    nNonOrthogonalCorrectors 2;
    nCorrectors     2;
    pRefCell        0;
    pRefValue       0;
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}



// ************************************************************************* //
